awslabs/amazon-kinesis-video-streams-webrtc-sdk-c/esp_port/components/media_stream/src/esp32p4_frame_grabber.c
    REG_CLR_BIT(HP_SYS_CLKRST_SOC_CLK_CTRL1_REG, HP_SYS_CLKRST_REG_CSI_HOST_SYS_CLK_EN);
    REG_SET_BIT(HP_SYS_CLKRST_SOC_CLK_CTRL1_REG, HP_SYS_CLKRST_REG_CSI_HOST_SYS_CLK_EN);
    REG_CLR_BIT(HP_SYS_CLKRST_SOC_CLK_CTRL1_REG, HP_SYS_CLKRST_REG_CSI_BRG_SYS_CLK_EN);
    REG_SET_BIT(HP_SYS_CLKRST_SOC_CLK_CTRL1_REG, HP_SYS_CLKRST_REG_CSI_BRG_SYS_CLK_EN);
    REG_SET_BIT(HP_SYS_CLKRST_HP_RST_EN0_REG, HP_SYS_CLKRST_REG_RST_EN_CSI_HOST);
    REG_CLR_BIT(HP_SYS_CLKRST_HP_RST_EN0_REG, HP_SYS_CLKRST_REG_RST_EN_CSI_HOST);
    REG_SET_BIT(HP_SYS_CLKRST_HP_RST_EN0_REG, HP_SYS_CLKRST_REG_RST_EN_CSI_BRG);
    REG_CLR_BIT(HP_SYS_CLKRST_HP_RST_EN0_REG, HP_SYS_CLKRST_REG_RST_EN_CSI_BRG);

    // REG_SET_FIELD(HP_SYS_CLKRST_PERI_CLK_CTRL03_REG, HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_DIV_NUM, (480000000 / MIPI_DPI_CLOCK_RATE) - 1);
    REG_SET_FIELD(HP_SYS_CLKRST_PERI_CLK_CTRL03_REG, HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_SRC_SEL, 1);
    REG_SET_BIT(HP_SYS_CLKRST_PERI_CLK_CTRL03_REG, HP_SYS_CLKRST_REG_MIPI_DSI_DPICLK_EN);

    REG_CLR_BIT(HP_SYS_CLKRST_SOC_CLK_CTRL1_REG, HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN);
    REG_SET_BIT(HP_SYS_CLKRST_SOC_CLK_CTRL1_REG, HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN);
    REG_SET_BIT(HP_SYS_CLKRST_HP_RST_EN0_REG, HP_SYS_CLKRST_REG_RST_EN_GDMA);
    REG_CLR_BIT(HP_SYS_CLKRST_HP_RST_EN0_REG, HP_SYS_CLKRST_REG_RST_EN_GDMA);

    REG_SET_FIELD(HP_SYS_CLKRST_PERI_CLK_CTRL26_REG, HP_SYS_CLKRST_REG_ISP_CLK_DIV_NUM, 1 - 1);
    REG_SET_FIELD(HP_SYS_CLKRST_PERI_CLK_CTRL25_REG, HP_SYS_CLKRST_REG_ISP_CLK_SRC_SEL, 1);
    REG_CLR_BIT(HP_SYS_CLKRST_PERI_CLK_CTRL25_REG, HP_SYS_CLKRST_REG_ISP_CLK_EN);
    REG_SET_BIT(HP_SYS_CLKRST_PERI_CLK_CTRL25_REG, HP_SYS_CLKRST_REG_ISP_CLK_EN);
    REG_SET_BIT(HP_SYS_CLKRST_HP_RST_EN0_REG, HP_SYS_CLKRST_REG_RST_EN_ISP);
    REG_CLR_BIT(HP_SYS_CLKRST_HP_RST_EN0_REG, HP_SYS_CLKRST_REG_RST_EN_ISP);

    rd = REG_READ(HP_SYS_CLKRST_REF_CLK_CTRL1_REG);
    REG_WRITE(HP_SYS_CLKRST_REF_CLK_CTRL1_REG, rd | HP_SYS_CLKRST_REG_REF_240M_CLK_EN);

    rd = REG_READ(HP_SYS_CLKRST_REF_CLK_CTRL2_REG);
    REG_WRITE(HP_SYS_CLKRST_REF_CLK_CTRL2_REG, rd | HP_SYS_CLKRST_REG_REF_160M_CLK_EN);

    rd = REG_READ(HP_SYS_CLKRST_HP_RST_EN2_REG);
    REG_WRITE(HP_SYS_CLKRST_HP_RST_EN2_REG, rd & (~HP_SYS_CLKRST_REG_RST_EN_H264));

    rd = REG_READ(HP_SYS_CLKRST_SOC_CLK_CTRL1_REG);
    rd = rd | HP_SYS_CLKRST_REG_H264_SYS_CLK_EN | HP_SYS_CLKRST_REG_GPSPI3_SYS_CLK_EN | HP_SYS_CLKRST_REG_AXI_PDMA_SYS_CLK_EN | HP_SYS_CLKRST_REG_GDMA_SYS_CLK_EN;
    rd = rd | HP_SYS_CLKRST_REG_CSI_HOST_SYS_CLK_EN | HP_SYS_CLKRST_REG_CSI_BRG_SYS_CLK_EN;
    REG_WRITE(HP_SYS_CLKRST_SOC_CLK_CTRL1_REG, rd);
    // H264_DMA
    rd = REG_READ(HP_SYS_CLKRST_PERI_CLK_CTRL26_REG);
    rd |= HP_SYS_CLKRST_REG_H264_CLK_EN;
    rd |= HP_SYS_CLKRST_REG_H264_CLK_SRC_SEL;
    REG_WRITE(HP_SYS_CLKRST_PERI_CLK_CTRL26_REG, rd);
}

void esp32p4_frame_grabber_cleanup(void)
{
#if SDCARD_SAVE
    if (f264) {
        fflush(f264);
        fclose(f264);
    }
#endif
}

typedef struct {
    QueueHandle_t frame_queue;
    TaskHandle_t encoder_task_handle;
    StaticTask_t *task_buffer;
    void *task_stack;
    bool encoder_initialized;
    bool running;
    SemaphoreHandle_t run_semaphore;
} esp32p4_encoder_data_t;

static esp32p4_encoder_data_t s_p4_enc_data = {0};

/* -------------------------------------------------------------------------- */
/*  Snapshot interceptor state                                                */
/* -------------------------------------------------------------------------- */

typedef struct {
    volatile bool requested;            /* Set by snapshot API, cleared by encoder task */
    SemaphoreHandle_t done;             /* Signaled when raw frame is copied */
    uint8_t *buffer;                    /* Destination buffer (caller-allocated) */
    size_t buffer_size;                 /* Allocated buffer size */
    size_t frame_len;                   /* Actual copied frame length */
    uint16_t width;                     /* Frame width */
    uint16_t height;                    /* Frame height */
    video_frame_pixformat_t pixfmt;     /* Pixel format of captured frame */
} snapshot_intercept_t;

static snapshot_intercept_t s_snapshot = {0};

#define QUEUE_RECEIVE_WAIT_MS  CONFIG_VIDEO_QUEUE_RECEIVE_WAIT_MS
#define QUEUE_SEND_WAIT_MS     CONFIG_VIDEO_QUEUE_SEND_WAIT_MS

esp_h264_out_buf_t *esp32p4_grab_one_frame()
{
    esp_h264_out_buf_t *frame_data = heap_caps_calloc(1, sizeof(esp_h264_out_buf_t), MALLOC_CAP_SPIRAM);
    if (xQueueReceive(s_p4_enc_data.frame_queue, frame_data, pdMS_TO_TICKS(QUEUE_RECEIVE_WAIT_MS)) != pdTRUE) {
        heap_caps_free(frame_data);
        return NULL;
    }
    return frame_data;
}

extern void *get_buffer();
extern esp_err_t esp_h264_hw_enc_set_reset_request();
static void video_encoder_task(void *arg)
{
    ESP_LOGD(TAG, "Video encoder task started (singleton mode - runs continuously)");

    while (1) {
        // Check if encoding should be running
        if (!s_p4_enc_data.running) {
            ESP_LOGD(TAG, "Video encoder paused, waiting for start signal...");
            // Wait for start signal (blocking)
            xSemaphoreTake(s_p4_enc_data.run_semaphore, portMAX_DELAY);
            ESP_LOGD(TAG, "Video encoder resumed");
        }

        video_frame_preprocess_fn_t frame_preprocess_fn = (video_frame_preprocess_fn_t) arg;
#if USE_ESP_VIDEO_IF
        // Get raw frame
        video_fb_t *raw_frame = esp_video_if_get_frame();
        if (!raw_frame) {
            vTaskDelay(pdMS_TO_TICKS(QUEUE_RECEIVE_WAIT_MS));
            continue;
        }

        // Snapshot interceptor: if a snapshot is requested, copy the raw frame
        if (s_snapshot.requested && s_snapshot.buffer) {
            video_resolution_t snap_res = {0};
            esp_video_if_get_resolution(&snap_res);

            size_t copy_len = (raw_frame->len <= s_snapshot.buffer_size)
                              ? raw_frame->len : s_snapshot.buffer_size;
            memcpy(s_snapshot.buffer, raw_frame->buf, copy_len);
            s_snapshot.frame_len = copy_len;
            s_snapshot.width = snap_res.width;
            s_snapshot.height = snap_res.height;
            s_snapshot.pixfmt = PIXFMT_YUV420;
            s_snapshot.requested = false;

            if (s_snapshot.done) {
                xSemaphoreGive(s_snapshot.done);
            }
        }

        // This assumes frame is YUV420
        if (frame_preprocess_fn)
        {
            video_resolution_t resolution;
            esp_err_t err = esp_video_if_get_resolution(&resolution);
            if (err == ESP_OK) {
                video_frame_raw_t frame = {
                    .len = raw_frame->len,
                    .buffer = raw_frame->buf,
                    .height = resolution.height,
                    .width = resolution.width,
                    .pixfmt = PIXFMT_YUV420,
                };

                frame_preprocess_fn(frame);
            }
        }

        // Encode the raw frame
        esp_h264_out_buf_t *frame = esp_h264_hw_enc_encode_frame(raw_frame->buf, raw_frame->len);

        // Release the raw frame as we're done with it
        esp_video_if_release_frame(raw_frame);

        // If encoding failed, continue to next frame
        if (!frame) {
            ESP_LOGW(TAG, "Frame encoding failed");
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }
#else
        static int frames_cnt = 0;
        esp_err_t ret = esp_h264_hw_enc_process_one_frame();
        if (ret != ESP_OK) {
            if (ret != ESP_ERR_NOT_FOUND) {
                ESP_LOGE(TAG, "Encoding failed");
            }
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }
        frames_cnt++;
        if (frames_cnt % 100 == 0) {
            ESP_LOGI(TAG, "frames_received_cnt %d, curr frame len %" PRIu32, frames_received_cnt, h264_out_data.len);
            print_mem_stats(TAG);
            if (frames_cnt % 250 == 0) {
                // Keep setting the bitrate periodically
                esp_h264_hw_enc_set_reset_request();
            }
        }

        // frame copy
        esp_h264_out_buf_t *frame = calloc(1, sizeof(esp_h264_out_buf_t));
        if (!frame) {
            ESP_LOGE(TAG, "Failed to alloc frame");
        }
        frame->len = h264_out_data.len;
        frame->buffer = heap_caps_aligned_calloc(64, 1, frame->len, MALLOC_CAP_SPIRAM);
        if (!frame->buffer) {
            ESP_LOGE(TAG, "Failed to alloc buffer. size %d", (int) frame->len);
        }
        esp_cache_msync(h264_out_data.buffer, (frame->len + 63) & ~63, ESP_CACHE_MSYNC_FLAG_DIR_M2C);
        memcpy(frame->buffer, h264_out_data.buffer, frame->len);
        frame->type = h264_out_data.type;
#endif
        if (xQueueSend(s_p4_enc_data.frame_queue, frame, pdMS_TO_TICKS(QUEUE_SEND_WAIT_MS)) != pdTRUE) {
            free(frame->buffer);
            vTaskDelay(pdMS_TO_TICKS(10));
        }
        free(frame);
    }

    ESP_LOGE(TAG, "Video encoder task unexpectedly exited!");
}

void esp32p4_frame_grabber_init(video_frame_preprocess_fn_t frame_preprocess_fn)
{
    // Singleton pattern: encoder task remains, but check if esp_video_if needs reinitialization
    if (s_p4_enc_data.encoder_initialized) {
        ESP_LOGD(TAG, "ESP32P4 frame grabber already initialized (singleton)");
#if USE_ESP_VIDEO_IF
        // Reinitialize esp_video_if if it was deinitialized (for power/security reasons)
        // esp_video_if_init() will check internally and return early if already initialized
        esp_err_t ret = esp_video_if_init();
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to reinitialize video interface: %s", esp_err_to_name(ret));
            return;
        }
#endif
        return;
    }

    init_chip();
    init_clock();

    s_p4_enc_data.frame_queue = xQueueCreate(CONFIG_VIDEO_FRAME_QUEUE_SIZE, sizeof(esp_h264_out_buf_t));
    if (!s_p4_enc_data.frame_queue) {
        ESP_LOGE(TAG, "Failed to create frame queue");
        goto cleanup;
    }

