awslabs/amazon-kinesis-video-streams-webrtc-sdk-c/esp_port/components/media_stream/src/esp32p4_frame_grabber.c
    // Create semaphore for start/stop control
    s_p4_enc_data.run_semaphore = xSemaphoreCreateBinary();
    if (!s_p4_enc_data.run_semaphore) {
        ESP_LOGE(TAG, "Failed to create run semaphore");
        goto cleanup;
    }
#if USE_ESP_VIDEO_IF
    esp_err_t ret = esp_video_if_init();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialize video interface");
        goto cleanup;
    }
    ESP_LOGD(TAG, "video interface initialized");
#else
    if (camera_init() != ESP_OK) {
        ESP_LOGE(TAG, "Camera initialization failed");
        goto cleanup;
    }
#endif
    vTaskDelay(pdMS_TO_TICKS(10));
#if SDCARD_SAVE
    sdmmc_card_t *sdcard = bsp_sdcard_mount();
    if (sdcard == NULL) {
        ESP_LOGE(TAG, "sdcard initialization failed!");
        goto cleanup;
    }

    printf("Filesystem mounted\n");
    // Card has been initialized, print its properties
    sdmmc_card_print_info(stdout, sdcard);

    char h264_name[100] = "/sdcard/encoded_file.h264"; // CONFIG_BSP_SD_MOUNT_POINT
    // sprintf(h264_name, "/eMMC/res_%d_%d.264", 1920, 1080);
    printf("h264_name %s \n", h264_name);

    f264 = fopen(h264_name, "wb+");
    if (f264 == NULL) {
        printf("H264 file create failed\n");
        esp32p4_frame_grabber_cleanup();
        goto cleanup;
    }
#endif

#if H264_ENCODE
    h264_enc_user_cfg_t cfg = {
        .enc_cfg = DEFAULT_ENCODER_CFG()
    };

    /* Get the ACTUAL camera resolution (which may differ from desired due to fallback) */
#if USE_ESP_VIDEO_IF
    video_resolution_t actual_resolution = {0};
    if (esp_video_if_get_resolution(&actual_resolution) == ESP_OK &&
        actual_resolution.width != 0 && actual_resolution.height != 0) {
        cfg.enc_cfg.res.width = actual_resolution.width;
        cfg.enc_cfg.res.height = actual_resolution.height;
        if (actual_resolution.fps != 0) {
            cfg.enc_cfg.fps = actual_resolution.fps;
        }
        ESP_LOGI(TAG, "Configuring encoder with actual camera resolution: %dx%d@%d",
                 cfg.enc_cfg.res.width, cfg.enc_cfg.res.height, cfg.enc_cfg.fps);
    }

    cfg.enc_cfg.fps = 27; /* used to distribute the bitrate */
    if (cfg.enc_cfg.res.height <= 720) {
        cfg.enc_cfg.rc.qp_min = 32;
        cfg.enc_cfg.rc.qp_max = 40;
    } else {
        cfg.enc_cfg.rc.qp_min = 35;
        cfg.enc_cfg.rc.qp_max = 42;
    }
#else
    cfg.read_cb = &data_read_callback,
    cfg.write_cb = &data_write_callback,
#endif

    esp_h264_setup_encoder(&cfg);

#define ENC_TASK_STACK_SIZE     CONFIG_VIDEO_ENCODER_TASK_STACK_SIZE
#define ENC_TASK_PRIO           CONFIG_VIDEO_ENCODER_TASK_PRIORITY
    s_p4_enc_data.task_buffer = heap_caps_calloc(1, sizeof(StaticTask_t), MALLOC_CAP_INTERNAL);
    s_p4_enc_data.task_stack = heap_caps_calloc(ENC_TASK_STACK_SIZE, 1, MALLOC_CAP_SPIRAM);
    if (!s_p4_enc_data.task_buffer || !s_p4_enc_data.task_stack) {
        ESP_LOGE(TAG, "Failed to allocate task buffers");
        goto cleanup;
    }

    s_p4_enc_data.running = false;  // Start in stopped state
    s_p4_enc_data.encoder_task_handle = xTaskCreateStatic(video_encoder_task, "video_encoder", ENC_TASK_STACK_SIZE,
                                                          frame_preprocess_fn, ENC_TASK_PRIO, s_p4_enc_data.task_stack, s_p4_enc_data.task_buffer);

    if (s_p4_enc_data.encoder_task_handle == NULL) {
        ESP_LOGE(TAG, "failed to create encoder task!");
        goto cleanup;
    }
#endif

    s_p4_enc_data.encoder_initialized = true;

    ESP_LOGD(TAG, "ESP32P4 frame grabber initialized as singleton (stopped, use start() to begin)");
    return;

cleanup:
    // Conditional cleanup based on what was allocated
    if (s_p4_enc_data.task_buffer != NULL) {
        heap_caps_free(s_p4_enc_data.task_buffer);
        s_p4_enc_data.task_buffer = NULL;
    }
    if (s_p4_enc_data.task_stack != NULL) {
        heap_caps_free(s_p4_enc_data.task_stack);
        s_p4_enc_data.task_stack = NULL;
    }
    if (s_p4_enc_data.run_semaphore != NULL) {
        vSemaphoreDelete(s_p4_enc_data.run_semaphore);
        s_p4_enc_data.run_semaphore = NULL;
    }
    if (s_p4_enc_data.frame_queue != NULL) {
        vQueueDelete(s_p4_enc_data.frame_queue);
        s_p4_enc_data.frame_queue = NULL;
    }

    ESP_LOGE(TAG, "ESP32P4 frame grabber initialization failed");
}

esp_err_t esp32p4_frame_grabber_start(void)
{
    if (!s_p4_enc_data.encoder_initialized) {
        ESP_LOGE(TAG, "ESP32P4 frame grabber not initialized");
        return ESP_ERR_INVALID_STATE;
    }

    if (s_p4_enc_data.running) {
        ESP_LOGD(TAG, "ESP32P4 frame grabber already running");
        return ESP_OK;
    }

    s_p4_enc_data.running = true;
    xSemaphoreGive(s_p4_enc_data.run_semaphore);  // Signal encoder to start
    ESP_LOGD(TAG, "ESP32P4 frame grabber started");

    return ESP_OK;
}

esp_err_t esp32p4_frame_grabber_stop(void)
{
    if (!s_p4_enc_data.encoder_initialized) {
        ESP_LOGE(TAG, "ESP32P4 frame grabber not initialized");
        return ESP_ERR_INVALID_STATE;
    }

    if (!s_p4_enc_data.running) {
        ESP_LOGD(TAG, "ESP32P4 frame grabber already stopped");
        return ESP_OK;
    }

    s_p4_enc_data.running = false;
    ESP_LOGD(TAG, "ESP32P4 frame grabber stopped");

    return ESP_OK;
}

esp_err_t esp32p4_frame_grabber_deinit(void)
{
    if (!s_p4_enc_data.encoder_initialized) {
        ESP_LOGD(TAG, "ESP32P4 frame grabber not initialized, nothing to deinitialize");
        return ESP_OK;
    }

    // Stop encoding first
    esp32p4_frame_grabber_stop();

    // Drain the frame queue with limited iterations to prevent infinite loop
    if (s_p4_enc_data.frame_queue != NULL) {
        ESP_LOGD(TAG, "Draining video frame queue...");
        esp_h264_out_buf_t h264_frame;
        int drained_count = 0;
        const int max_drain_iterations = CONFIG_VIDEO_FRAME_QUEUE_SIZE;  // Prevent infinite loop

        while (xQueueReceive(s_p4_enc_data.frame_queue, &h264_frame, 0) == pdTRUE &&
               drained_count < max_drain_iterations) {
            if (h264_frame.buffer) {
                heap_caps_free(h264_frame.buffer);
            }
            drained_count++;
        }

        if (drained_count > 0) {
            ESP_LOGD(TAG, "Drained %d video frames from queue", drained_count);
        }
        if (drained_count >= max_drain_iterations) {
            ESP_LOGI(TAG, "Reached max drain limit, queue may still contain frames");
        }
    }

