awslabs/amazon-kinesis-video-streams-webrtc-sdk-c/esp_port/components/media_stream/src/esp32p4_frame_grabber.c
    // Singleton pattern: encoder task remains running but paused
    ESP_LOGD(TAG, "ESP32P4 frame grabber is singleton - task remains paused until start() is called");

#if USE_ESP_VIDEO_IF
    esp_video_if_deinit();
#endif
    return ESP_OK;
}

/* -------------------------------------------------------------------------- */
/*  Snapshot interceptor API                                                  */
/* -------------------------------------------------------------------------- */

bool esp32p4_is_encoder_running(void)
{
    return s_p4_enc_data.running;
}

bool esp32p4_is_encoder_initialized(void)
{
    return s_p4_enc_data.encoder_initialized;
}

#if USE_ESP_VIDEO_IF
/**
 * Intercept the next raw frame from the encoder task.
 * The caller provides a pre-allocated buffer. The encoder task copies the next
 * raw frame into it and signals completion via a semaphore.
 *
 * @param buf[out]        Pointer to store the raw frame buffer (caller-allocated, SPIRAM)
 * @param len[out]        Pointer to store the actual frame length
 * @param width[out]      Pointer to store frame width
 * @param height[out]     Pointer to store frame height
 * @param pixfmt[out]     Pointer to store pixel format
 * @param timeout_ms      Maximum wait time in milliseconds
 * @return ESP_OK on success, ESP_ERR_TIMEOUT on timeout
 */
esp_err_t esp32p4_snapshot_intercept_frame(uint8_t *buf, size_t buf_size,
                                           size_t *len, uint16_t *width,
                                           uint16_t *height,
                                           video_frame_pixformat_t *pixfmt,
                                           uint32_t timeout_ms)
{
    if (!buf || !len || !width || !height || buf_size == 0) {
        return ESP_ERR_INVALID_ARG;
    }

    if (!s_p4_enc_data.running) {
        return ESP_ERR_INVALID_STATE;
    }

    /* Reject overlapping requests: a second caller would clobber buffer/buffer_size
     * before the encoder task copies the frame for the first one. */
    if (s_snapshot.requested) {
        return ESP_ERR_INVALID_STATE;
    }

    /* Create the done semaphore if not yet created */
    if (!s_snapshot.done) {
        s_snapshot.done = xSemaphoreCreateBinary();
        if (!s_snapshot.done) {
            return ESP_ERR_NO_MEM;
        }
    }

    /* Prepare the snapshot request */
    s_snapshot.buffer = buf;
    s_snapshot.buffer_size = buf_size;
    s_snapshot.frame_len = 0;
    s_snapshot.width = 0;
    s_snapshot.height = 0;
    s_snapshot.requested = true;  /* Trigger the interceptor in encoder task */

    /* Wait for the encoder task to copy a frame */
    if (xSemaphoreTake(s_snapshot.done, pdMS_TO_TICKS(timeout_ms)) != pdTRUE) {
        s_snapshot.requested = false;
        ESP_LOGE(TAG, "Snapshot intercept timed out");
        return ESP_ERR_TIMEOUT;
    }

    *len = s_snapshot.frame_len;
    *width = s_snapshot.width;
    *height = s_snapshot.height;
    if (pixfmt) {
        *pixfmt = s_snapshot.pixfmt;
    }

    return ESP_OK;
}

/**
 * Directly grab a raw frame from the camera when the encoder task is NOT running.
 * This is safe only when the encoder task is paused (not consuming frames).
 *
 * @param buf[out]        Pre-allocated buffer for the raw frame
 * @param buf_size        Size of the buffer
 * @param len[out]        Actual frame length
 * @param width[out]      Frame width
 * @param height[out]     Frame height
 * @param pixfmt[out]     Pixel format
 * @param timeout_ms      Maximum wait time
 * @return ESP_OK on success
 */
esp_err_t esp32p4_snapshot_direct_grab(uint8_t *buf, size_t buf_size,
                                       size_t *len, uint16_t *width,
                                       uint16_t *height,
                                       video_frame_pixformat_t *pixfmt,
                                       uint32_t timeout_ms)
{
    if (!buf || !len || !width || !height || buf_size == 0) {
        return ESP_ERR_INVALID_ARG;
    }

    bool need_init = false;
    bool need_start = false;

    /* If esp_video_if is not initialized, temporarily init it */
    if (!s_p4_enc_data.encoder_initialized) {
        /* Full initialization needed (chip, clock, video interface) */
        init_chip();
        init_clock();
        esp_err_t ret = esp_video_if_init();
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to init video interface for snapshot: %s", esp_err_to_name(ret));
            return ret;
        }
        need_init = true;
        need_start = true;
    } else {
        /* Camera is initialized but encoder might be paused.
         * esp_video_if might have been deinitialized (streaming stopped).
         * Reinit to restart streaming if needed. */
        esp_err_t ret = esp_video_if_init();
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to reinit video interface for snapshot: %s", esp_err_to_name(ret));
            return ret;
        }
        need_start = true;
    }

    /* Discard initial frames after STREAMON to let sensor/ISP settle
     * (exposure, white balance). Without this the first frame is often
     * noisy and produces an abnormally large JPEG. */
    if (need_start) {
        const int warmup_frames = 5;
        for (int i = 0; i < warmup_frames; i++) {
            video_fb_t *discard = esp_video_if_get_frame();
            if (discard) {
                esp_video_if_release_frame(discard);
            }
        }
        ESP_LOGD(TAG, "Discarded %d warmup frames", warmup_frames);
    }

    /* Get one raw frame */
    video_fb_t *raw_frame = esp_video_if_get_frame();
    if (!raw_frame) {
        ESP_LOGE(TAG, "Failed to get raw frame for snapshot");
        if (need_init) {
            esp_video_if_deinit();
        }
        return ESP_ERR_NOT_FOUND;
    }

    /* Copy frame data */
    size_t copy_len = (raw_frame->len <= buf_size) ? raw_frame->len : buf_size;
    memcpy(buf, raw_frame->buf, copy_len);

    video_resolution_t resolution = {0};
    esp_video_if_get_resolution(&resolution);

    *len = copy_len;
    *width = resolution.width;
    *height = resolution.height;
    if (pixfmt) {
        *pixfmt = PIXFMT_YUV420;
    }

    /* Release the raw frame back to the driver */
    esp_video_if_release_frame(raw_frame);

    /* Stop streaming so the next snapshot can cleanly restart */
    esp_video_if_stop();

    if (need_init) {
        esp_video_if_deinit();
    }

    return ESP_OK;
}
#endif /* USE_ESP_VIDEO_IF */

#endif
